<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>Internship-Diary-July-19 - Jerome&#39;s Blog</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="WHU sutdent, Computer Graphic, Game Engine">





    <meta name="description" content="&amp;#x4E00;&amp;#x8F6C;&amp;#x773C;&amp;#x95F4;&amp;#x5165;&amp;#x804C;&amp;#x4E24;&amp;#x4E2A;&amp;#x6708;&amp;#xFF0C;&amp;#x6765;&amp;#x6DF1;&amp;#x5733;&amp;#x5DF2;&amp;#x7ECF;&amp;#x4E00;&amp;#x4E2A;&amp;#x6708;&amp;#x4E86;&amp;#x2026;..&amp;#x6512;&amp;#x4E86;&amp;#x597D;&amp;#x591A;&amp;#x60F">
<meta property="og:type" content="article">
<meta property="og:title" content="Internship-Diary-July-19">
<meta property="og:url" content="http://yoursite.com/2020/07/19/Internship-Diary-July-19/index.html">
<meta property="og:site_name" content="Jerome&#39;s Blog">
<meta property="og:description" content="&amp;#x4E00;&amp;#x8F6C;&amp;#x773C;&amp;#x95F4;&amp;#x5165;&amp;#x804C;&amp;#x4E24;&amp;#x4E2A;&amp;#x6708;&amp;#xFF0C;&amp;#x6765;&amp;#x6DF1;&amp;#x5733;&amp;#x5DF2;&amp;#x7ECF;&amp;#x4E00;&amp;#x4E2A;&amp;#x6708;&amp;#x4E86;&amp;#x2026;..&amp;#x6512;&amp;#x4E86;&amp;#x597D;&amp;#x591A;&amp;#x60F">
<meta property="og:locale" content="zh_CN">
<meta property="article:published_time" content="2020-07-19T14:17:49.000Z">
<meta property="article:modified_time" content="2020-07-19T15:13:50.000Z">
<meta property="article:author" content="Jerome">
<meta property="article:tag" content="Diary">
<meta property="article:tag" content="IEG">
<meta name="twitter:card" content="summary">





<link rel="icon" href="/images/logo.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


<meta name="generator" content="Hexo 4.2.0"><link rel="alternate" href="/atom.xml" title="Jerome's Blog" type="application/atom+xml">
</head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    Jerome&#39;s Blog
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/archives">档案</a>
            
            <a class="navbar-item "
               href="/categories/Internship">实习</a>
            
            <a class="navbar-item "
               href="/categories/Development">开发</a>
            
            <a class="navbar-item "
               href="/categories/Learning">学习</a>
            
            <a class="navbar-item "
               href="/categories/JEngine">JEngine</a>
            
            <a class="navbar-item "
               href="/about">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/peter-819" target="_blank" rel="noopener">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            Internship-Diary-July-19
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2020-07-19T14:17:49.000Z" itemprop="datePublished">7月 19 2020</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/Internship/">Internship</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            12 分钟 读完 (约 1808 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>&#x4E00;&#x8F6C;&#x773C;&#x95F4;&#x5165;&#x804C;&#x4E24;&#x4E2A;&#x6708;&#xFF0C;&#x6765;&#x6DF1;&#x5733;&#x5DF2;&#x7ECF;&#x4E00;&#x4E2A;&#x6708;&#x4E86;&#x2026;..<br>&#x6512;&#x4E86;&#x597D;&#x591A;&#x60F3;&#x8BF4;&#x7684;&#x8BDD;&#xFF0C;&#x4E00;&#x5757;&#x8BF4;&#x8BF4;&#x5427;..</p>
<a id="more"></a>

<ul>
<li>&#x7410;&#x4E8B;</li>
</ul>
<p>&#x8BB0;&#x5F97;&#x597D;&#x50CF;&#x662F;&#x516D;&#x6708;&#x5341;&#x516D;&#x53F7;&#x6765;&#x7684;&#x6DF1;&#x5733;&#xFF0C;&#x4F4F;&#x4E86;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#x7684;&#x4E2D;&#x8F6C;&#x9152;&#x5E97;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x57CE;&#x4E2D;&#x6751;&#x8FD9;&#x91CC;&#x627E;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x516C;&#x5BD3;&#xFF0C;&#x4E0D;&#x600E;&#x4E48;&#x8D35;&#x7684;&#x79DF;&#x4E86;&#x4E24;&#x4E2A;&#x6708;&#x3002;<br>&#x6765;&#x7684;&#x7B2C;&#x4E00;&#x5929;&#x665A;&#x4E0A;&#x5728;&#x5BBE;&#x9986;&#x5446;&#x5F97;&#x65E0;&#x804A;&#xFF0C;&#x53BB;&#x79D1;&#x5174;&#x9886;&#x4E86;&#x4E00;&#x5F20;&#x4E34;&#x65F6;&#x5DE5;&#x5361;&#xFF0C;&#x4E0A;&#x697C;&#x627E;&#x5230;&#x4E86;sunny&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x56DB;&#x4E2A;&#x5EA7;&#x4F4D;&#x56F4;&#x6210;&#x4E00;&#x5708;&#x3002;<br>&#x90A3;&#x5929;&#x53BB;&#x516C;&#x53F8;&#x7684;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x665A;&#x4E0A;11&#x70B9;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x9646;&#x9646;&#x7EED;&#x7EED;&#x5730;&#x4ECE;&#x516C;&#x53F8;&#x51FA;&#x6765;&#xFF0C;&#x5F53;&#x65F6;&#x8FD8;&#x4EE5;&#x4E3A;&#x662F;&#x521A;&#x521A;&#x4E0B;&#x73ED;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x5B9E;&#x662F;10&#x70B9;&#x4EE5;&#x540E;&#x514D;&#x8D39;&#x6253;&#x8F66;hh</p>
<p>&#x7B2C;&#x4E8C;&#x5929;&#x62FF;&#x4E86;&#x4E34;&#x65F6;&#x5DE5;&#x5361;&#x8FDB;&#x516C;&#x53F8;&#x627E;&#x5230;&#x4E86;sunny&#xFF0C;&#x5B89;&#x6392;&#x6211;&#x5750;&#x5728;&#x4E86;zesheng&#x65C1;&#x8FB9;&#x5F97;&#x4F4D;&#x7F6E;&#xFF0C;&#x5360;&#x4E86;zesheng&#x65C1;&#x8FB9;&#x59B9;&#x5B50;&#x5F97;&#x4F4D;&#x7F6E;(bushi)<br>&#x7B2C;&#x4E00;&#x5929;&#x597D;&#x50CF;&#x8FDE;&#x597D;&#x7535;&#x8111;&#x5C31;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x4E86;&#xFF0C;&#x6BD5;&#x7ADF;&#x4E4B;&#x524D;&#x7EBF;&#x4E0A;&#x4E00;&#x4E2A;&#x6708;&#x7535;&#x8111;&#x4E0A;&#x9762;&#x73AF;&#x5883;&#x90FD;&#x662F;&#x914D;&#x7F6E;&#x597D;&#x7684;&#x3002;<br>&#x516C;&#x53F8;&#x98DF;&#x5802;&#x5F88;&#x597D;&#x5403;&#xFF0C;&#x5403;&#x5B8C;&#x7EC4;&#x91CC;&#x8FD8;&#x6709;&#x996D;&#x540E;&#x767E;&#x6B65;&#x8D70;&#x7684;&#x517B;&#x751F;&#x6D3B;&#x52A8;&#x3002;&#x4F53;&#x9A8C;&#x5F88;&#x597D;~</p>
<p>&#x7136;&#x540E;&#x7684;&#x4E24;&#x4E09;&#x5929;&#x5C31;&#x8DDF;&#x5E73;&#x65F6;&#x7EBF;&#x4E0A;&#x4E00;&#x6837;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x6709;&#x4E2D;&#x8F6C;&#x4F4F;&#x5BBF;&#x5148;&#x4F4F;&#x7740;&#x4E5F;&#x8FD8;&#x6CA1;&#x8003;&#x8651;&#x79DF;&#x623F;&#x5B50;&#x7684;&#x95EE;&#x9898;&#x3002;<br>&#x95EE;&#x4E2D;&#x4ECB;&#x627E;&#x4E86;&#x4E00;&#x4E2A;&#x57CE;&#x4E2D;&#x6751;&#x7684;&#x5C0F;&#x516C;&#x5BD3;&#xFF0C;&#x8FD8;&#x7B97;&#x4FBF;&#x5B9C;&#xFF0C;&#x4E00;&#x4E2A;&#x6708;2k2&#x5DE6;&#x53F3;&#xFF0C;&#x867D;&#x7136;&#x697C;&#x4E0B;&#x5F88;&#x7834;&#x4F46;&#x662F;&#x6BD5;&#x7ADF;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x4F4F;&#xFF0C;&#x611F;&#x89C9;&#x8FD8;&#x53EF;&#x4EE5;&#x3002;<br>&#x9152;&#x5E97;&#x5230;&#x671F;&#x5C31;&#x642C;&#x5230;&#x4E86;&#x8FD9;&#x91CC;&#xFF0C;&#x7F51;&#x8D2D;&#x4E86;&#x4E00;&#x4E9B;&#x88AB;&#x8925;&#x4E4B;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x65E5;&#x5B50;&#x7A81;&#x7136;&#x5C31;&#x8FC7;&#x7684;&#x5FEB;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x56E2;&#x5EFA;&#x53BB;&#x5403;&#x4E86;&#x4E00;&#x987F;&#x70E7;&#x70E4;&#xFF0C;&#x559D;&#x4E86;&#x70B9;&#x9152;..&#x611F;&#x89C9;&#x7EC4;&#x91CC;&#x7684;&#x6C1B;&#x56F4;&#x5F88;&#x8F7B;&#x677E;&#x7684;&#x90A3;&#x79CD;<br>&#x5E73;&#x65F6;&#x5DE5;&#x4F5C;&#x65F6;&#x95F4;&#x57FA;&#x672C;&#x4E5F;&#x5C31;&#x662F;&#x65E9;&#x4E0A;&#x4E5D;&#x70B9;&#x5230;&#x665A;&#x4E0A;&#x516B;&#x70B9;&#x591A;&#x9886;&#x4E86;&#x591C;&#x5BB5;&#x5238;&#x518D;&#x8D70;&#x3002;&#x5468;&#x672B;&#x4E5F;&#x662F;&#x968F;&#x7F18;&#x53BB;&#x516C;&#x53F8;&#x5212;&#x6C34;&#xFF0C;&#x6CA1;&#x6709;996&#x7684;&#x90A3;&#x79CD;&#x611F;&#x89C9;&#x3002;<br>&#x636E;&#x8BF4;&#x5F15;&#x64CE;&#x7EC4;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;</p>
<p>&#x4E00;&#x6643;&#x5C31;&#x8FC7;&#x53BB;&#x4E86;&#x56DB;&#x5468;&#xFF0C;&#x8FC7;&#x4E86;&#x7AEF;&#x5348;&#x8282;&#xFF0C;&#x5E73;&#x65F6;&#x5468;&#x672B;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x4F1A;&#x8DDF;xyjj&#x6C5F;&#x6E56;&#x51FA;&#x53BB;&#x8F6C;&#x8F6C;&#x3002;&#x6709;&#x4E00;&#x6B21;&#x8FD8;&#x8DD1;&#x5230;xyjj&#x5BB6;&#x6070;&#x706B;&#x9505;&#xFF0C;&#x4E09;&#x4E2A;&#x4EBA;&#x5728;&#x5C4B;&#x5B50;&#x91CC;&#x80A5;&#x5B85;&#x4E86;&#x4E00;&#x6574;&#x5929;&#x3002;<br>&#x8FD9;&#x5C31;&#x662F;&#x80A5;&#x5B85;&#x7684;&#x7EC8;&#x6781;&#x5FEB;&#x4E50;&#x5427;~ &#x6DF1;&#x5733;&#x8FD9;&#x91CC;&#x786E;&#x5B9E;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x73A9;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x9AD8;&#x697C;&#x5927;&#x53A6;&#x5199;&#x5B57;&#x697C;&#x3002; &#x9002;&#x5408;&#x611F;&#x53D7;&#x4E00;&#x4E0B;&#x8D2B;&#x5BCC;&#x5DEE;&#x8DDD;&#x7F62;&#x4E86;</p>
<p>&#x5E73;&#x65F6;&#x5728;&#x516C;&#x53F8;&#x5C31;&#x662F;&#x5199;&#x5199;&#x4EE3;&#x7801;&#x5212;&#x5212;&#x6C34;&#x5403;&#x996D;&#xFF0C;&#x5212;&#x6C34;&#x5403;&#x996D;&#xFF0C;&#x5212;&#x6C34;&#x5403;&#x996D;&#xFF0C;&#x5212;&#x6C34;&#x5403;&#x996D;&#x2026;.<br>&#x6DF1;&#x5733;&#x8FD9;&#x8FB9;&#x7684;&#x51E0;&#x4F4D;&#x597D;&#x50CF;&#x90FD;&#x662F;&#x4EE5;&#x524D;xsj&#x7684;&#x4EBA;&#xFF0C;&#x4E5F;&#x7B97;&#x662F;&#x8001;&#x76F8;&#x8BC6;&#x4E86;&#x3002;<br>&#x7FA4;&#x91CC;&#x5F00;&#x5F00;&#x8F66;&#xFF0C;&#x5E73;&#x65F6;&#x5439;&#x5439;&#x6C34;&#x90FD;&#x5F88;&#x878D;&#x6D3D;&#x3002;&#x800C;&#x4E14;&#x597D;&#x50CF;&#x90FD;&#x591A;&#x5C11;&#x5728;&#x6B66;&#x6C49;&#x5446;&#x8FC7;hh</p>
<p>&#x4E00;&#x8F6C;&#x773C;&#x5C31;&#x5230;&#x4E86;&#x7B2C;&#x56DB;&#x5468;&#xFF0C;&#x8FD8;&#x6CA1;&#x6765;&#x5F97;&#x53CA;&#x5E86;&#x795D;&#x4E00;&#x4E0B;&#x6765;&#x6DF1;&#x5733;&#x4E00;&#x4E2A;&#x6708;&#x5C31;&#x53BB;&#x4E86;&#x4E00;&#x8D9F;&#x533B;&#x9662;&#x3002;&#x3002;&#x3002;<br>&#x4E0A;&#x5468;&#x672B;&#x548C;lpl&#x53BB;&#x5403;&#x4E86;&#x4E00;&#x987F;&#x70E4;&#x8089;&#xFF0C;&#x9001;&#x4ED6;&#x53BB;&#x5C01;&#x57F9;&#xFF0C;&#x56DE;&#x6765;&#x7684;&#x65F6;&#x5019;&#x4E0B;&#x8F66;&#x65E9;&#x4E86;&#x4E24;&#x7AD9;&#xFF0C;&#x5927;&#x70ED;&#x7684;&#x4E2D;&#x5348;&#x8D70;&#x4E86;&#x597D;&#x4E45;&#xFF0C;&#x611F;&#x89C9;&#x5230;&#x516C;&#x53F8;&#x4E4B;&#x540E;&#x5C31;&#x6709;&#x70B9;&#x55D3;&#x5B50;&#x75DB;<br>&#x540E;&#x6765;&#x6CA1;&#x5F53;&#x56DE;&#x4E8B;&#xFF0C;&#x5468;&#x4E8C;&#x4E2D;&#x5348;&#x6D51;&#x8EAB;&#x53D1;&#x51B7;&#x624D;&#x611F;&#x89C9;&#x4E0D;&#x5BF9;&#xFF0C;&#x53BB;&#x533B;&#x52A1;&#x5BA4;&#x4E00;&#x6D4B;39&#x5EA6;&#xFF0C;&#x76F4;&#x63A5;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x4E0B;&#x73ED;..<br>&#x4E00;&#x4E2A;&#x4EBA;&#x8DD1;&#x5230;&#x5357;&#x5C71;&#x533B;&#x9662;&#x505A;&#x6838;&#x9178;&#x68C0;&#x6D4B;&#xFF0C;&#x62CD;CT&#xFF0C;&#x88AB;&#x8E22;&#x76AE;&#x7403;&#x2026;.&#x8FD8;&#x597D;&#x5361;&#x91CC;&#x6709;&#x94B1;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x611F;&#x89C9;&#x5230;&#x515C;&#x91CC;&#x6709;&#x94B1;&#x7684;&#x5B89;&#x5168;&#x611F;&#x3002;</p>
<p>&#x75C5;&#x597D;&#x4E86;&#x4E4B;&#x540E;&#x8D76;&#x4E0A;&#x5B59;&#x8001;&#x677F;&#x6D9B;&#x54E5;&#x6765;&#x6DF1;&#x5733;&#xFF0C;zesheng&#x6E05;&#x6211;&#x4EEC;&#x5403;&#x70E4;&#x7F8A;&#x6392;&#xFF0C;&#x6253;&#x8F66;&#x4E00;&#x4E2A;&#x591A;&#x5C0F;&#x65F6;&#x8DD1;&#x5230;&#x7F57;&#x6E56;&#x90A3;&#x91CC;&#x53BB;&#x5403;hh<br>&#x8DEF;&#x4E0A;&#x8DDF;&#x80A1;&#x4E1C;&#x6253;&#x8F66;&#x53BB;&#xFF0C;&#x5728;&#x8F66;&#x4E0A;&#x626F;&#x8FD9;&#x626F;&#x90A3;&#xFF0C;&#x6B63;&#x597D;&#x78B0;&#x4E0A;&#x730E;&#x5934;&#x7ED9;&#x4ED6;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x540E;&#x6765;&#x4E1C;&#x626F;&#x626F;&#x897F;&#x626F;&#x626F;&#x5C31;&#x5230;&#x4E86;</p>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x611F;&#x89C9;&#x8FD9;&#x4E2A;&#x7EC4;&#x8FD8;&#x662F;&#x5F88;&#x6709;&#x6D3B;&#x529B;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x5F15;&#x64CE;&#x521A;&#x521A;&#x8D77;&#x6B65;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4EE5;&#x540E;&#x4F1A;&#x53D1;&#x5C55;&#x6210;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x597D;&#x597D;&#x53D1;&#x5C55;&#x4E0B;&#x53BB;&#xFF0C;&#x8FD9;&#x6837;&#x5230;&#x6211;&#x6BD5;&#x4E1A;&#x7684;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;<br>&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x6210;&#x719F;&#x7684;&#x9879;&#x76EE;&#x4E86;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x5230;&#x65F6;&#x5019;&#x5206;&#x4E00;&#x676F;&#x7FB9;&#x5427;<br>&#x6BD5;&#x7ADF;&#x73B0;&#x5728;&#x5230;&#x6211;&#x771F;&#x6B63;&#x8C08;offer&#x8FD8;&#x6709;&#x4E00;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6700;&#x597D;&#x5728;&#x8FD9;&#x4E2A;&#x5B9E;&#x4E60;&#x671F;&#x95F4;&#x80FD;&#x591F;&#x63A2;&#x542C;&#x5230;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x600E;&#x4E48;&#x80FD;&#x8BA9;&#x81EA;&#x5DF1;&#x5728;&#x660E;&#x5E74;&#x7684;argue&#x4E2D;&#x66F4;&#x6709;&#x4F18;&#x52BF;&#x4E00;&#x4E9B;&#x3002;</p>
<ul>
<li>&#x77E5;&#x8BC6;</li>
</ul>
<p>&#x600E;&#x4E48;&#x8BF4;&#x5462;&#xFF0C;&#x611F;&#x89C9;&#x5728;&#x8FD9;&#x91CC;&#x5B9E;&#x4E60;&#x8FD9;&#x4E24;&#x4E2A;&#x6708;&#xFF0C;&#x4E3B;&#x8981;&#x63D0;&#x9AD8;&#x7684;&#x8FD8;&#x662F;&#x4E00;&#x4E9B;&#x5B9E;&#x9645;&#x5B9E;&#x73B0;&#x80FD;&#x529B;&#xFF0C;&#x628A;&#x4E4B;&#x524D;&#x5B66;&#x7684;&#x96F6;&#x96F6;&#x788E;&#x788E;&#x7684;&#x77E5;&#x8BC6;&#x6574;&#x7406;&#x7684;&#x66F4;&#x6709;&#x6761;&#x7406;&#x4E86;&#x5427;<br>&#x5F00;&#x53D1;&#x4E0A;&#x7684;&#x7EC6;&#x8282;&#x4E86;&#x89E3;&#x7684;&#x66F4;&#x591A;&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;&#x8981;&#x662F;&#x8BF4;&#x4EC0;&#x4E48;&#x65B0;&#x7684;feature&#x6216;&#x8005;&#x65B0;&#x7684;&#x77E5;&#x8BC6;&#x5B66;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#xFF0C;&#x6BCF;&#x5929;&#x9664;&#x4E86;&#x5199;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x95F4;&#x6211;&#x57FA;&#x672C;&#x90FD;&#x5212;&#x6C34;&#x4E86;&#x2026;.<br>&#x6512;&#x4E00;&#x6CE2;&#x60F3;&#x5B66;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B66;&#x671F;&#x5F00;&#x59CB;&#x4E4B;&#x540E;&#x81EA;&#x5DF1;&#x53BB;&#x770B;&#x4E00;&#x4E0B;&#x5427;&#xFF01;</p>
<p>&#x4E3B;&#x8981;80%&#x7684;&#x4E1C;&#x897F;&#x8FD8;&#x662F;OpenGL ES&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x8BF4;&#x8D77;&#x6765;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x96BE;&#x5EA6;&#xFF0C;&#x90FD;&#x662F;&#x5404;&#x79CD;&#x6A21;&#x5757;&#x91CD;&#x6784;&#x4E4B;&#x7C7B;&#x7684;&#x4EFB;&#x52A1;&#x3002;<br>&#x7136;&#x540E;&#x7EBF;&#x4E0A;&#x7684;&#x65F6;&#x5019;&#x665A;&#x4E0A;&#x6BD4;&#x8F83;&#x62FC;&#xFF0C;&#x8FD8;&#x5B66;&#x4E86;&#x4E00;&#x5468;&#x5DE6;&#x53F3;&#x7684;&#x7B80;&#x5355;vulkan&#x3002;&#x5927;&#x6982;&#x5BF9;&#x4E8E;DX/VK&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x4E86;&#x89E3;&#x6846;&#x67B6;&#x7684;&#x9636;&#x6BB5;&#xFF0C;<br>&#x5177;&#x4F53;&#x5F00;&#x53D1;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x505A;&#x8FC7;&#x7684;&#x3002;</p>
<p>&#x4E3B;&#x8981;&#x4E86;&#x89E3;&#x4E86;&#x4E00;&#x4E9B;RHI&#x5BF9;&#x4E8E;&#x4E09;&#x4E2A;API&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x6027;&#x8FDB;&#x884C;&#x63A5;&#x53E3;&#x62BD;&#x8C61;&#x8FD9;&#x4E2A;&#x601D;&#x8DEF;&#xFF0C;&#x4EE5;&#x53CA;&#x4ED6;&#x4EEC;&#x7684;&#x5177;&#x4F53;&#x60F3;&#x6CD5;&#x3002;<br>&#x8981;&#x8BF4;&#x8FD8;&#x5B66;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x662F;&#x7B80;&#x5355;&#x7684;&#x4E86;&#x89E3;&#x4E86;&#x4E00;&#x70B9;&#x70B9;frame graph&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E00;&#x76F4;&#x60F3;&#x8BFB;&#x4E00;&#x4E0B;&#x5B59;&#x8001;&#x677F;&#x5199;&#x7684;render graph&#x4EE3;&#x7801;<br>&#x4F46;&#x662F;&#x4E00;&#x76F4;&#x90FD;&#x88AB;&#x4EE3;&#x7801;&#x91CF;&#x529D;&#x9000;&#xFF0C;&#x53EA;&#x80FD;&#x5927;&#x6982;&#x4E86;&#x89E3;&#x4E00;&#x70B9;&#x6846;&#x67B6;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x56FE;&#x5F62;&#x5B66;&#xFF0C;&#x6211;&#x8FD9;&#x6839;&#x672C;&#x8FD8;&#x4E0D;&#x7B97;&#x662F;&#x505A;&#x56FE;&#x5F62;&#x5B66;&#xFF0C;&#x53EA;&#x662F;&#x7F8E;&#x5176;&#x540D;&#x66F0;&#x7F62;&#x4E86;&#x3002;<br>&#x4E00;&#x4E9B;feature&#x8FD8;&#x5F97;&#x7B49;&#x56DE;&#x5B66;&#x6821;&#x53BB;&#x4E00;&#x4E2A;&#x4E2A;&#x5B9E;&#x73B0;&#x4E00;&#x4E0B;&#x3002;&#x81F3;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;demo&#x8FD8;&#x662F;&#x8981;&#x53BB;&#x8865;&#x5145;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD8;&#x662F;&#x86EE;&#x60F3;&#x5199;&#x4E00;&#x70B9;VK&#x7684;<br>&#x4E0D;&#x8FC7;&#x786E;&#x5B9E;&#x5DE5;&#x4F5C;&#x91CF;&#x5E9E;&#x5927;&#xFF0C;&#x9700;&#x8981;&#x633A;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x8FD9;&#x8F6E;&#x5B9E;&#x4E60;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#x6211;&#x5927;&#x6982;&#x5E94;&#x8BE5;<br>&#x5199;&#x4E00;&#x4E0B;JEngine&#x7684;VK&#x5B9E;&#x73B0;&#xFF0C;&#x518D;&#x5728;&#x4E0A;&#x5C42;&#x7B80;&#x5355;&#x5C01;&#x88C5;&#x4E00;&#x4E2A;render graph&#x3002;<br>&#x5728;&#x505A;&#x8FD9;&#x4E9B;&#x7684;&#x540C;&#x65F6;&#x770B;&#x4E00;&#x4E9B;&#x56FE;&#x5F62;&#x5B66;&#x7406;&#x8BBA;&#xFF0C;&#x6700;&#x597D;&#x80FD;&#x5728;JEngine&#x91CC;&#x5B9E;&#x73B0;&#x4E00;&#x70B9;feature<br>&#x5982;&#x679C;&#x5DE5;&#x4F5C;&#x91CF;&#x592A;&#x5927;&#x7684;&#x8BDD;&#x5C31;&#x5148;&#x53BB;&#x641E;&#x4E00;&#x4E0B;UE4&#x5427;&#xFF0C;UE4&#x91CC;&#x5B66;&#x7740;&#x5199;&#x70B9;feature&#x3002;<br>&#x554A;&#x5BF9;&#xFF0C;&#x8FD8;&#x6709;&#x5B66;Ray Tracing<br>&#x5269;&#x4E0B;&#x7684;&#x5C31;&#x662F;&#x6211;&#x5929;&#x5929;&#x53E8;&#x53E8;&#x7684;&#x5B66;&#xFF24;&#xFF23;&#xFF23;&#x5DE5;&#x5177;&#x3002;&#x3002;&#x3002;</p>
<p>&#x5E0C;&#x671B;&#x5728;&#x5269;&#x4E0B;&#x8FD9;&#x4E00;&#x4E2A;&#x6708;&#x5DE6;&#x53F3;&#x7684;&#x5B9E;&#x4E60;&#x65F6;&#x95F4;&#x91CC;&#x6211;&#x80FD;&#x628A;GLES&#x8FD9;&#x8FB9;&#x7684;&#x9505;&#x641E;&#x5B8C;&#xFF0C;&#x518D;&#x63A5;&#x89E6;&#x4E00;&#x70B9;&#x5176;&#x4ED6;&#x7684;&#x4E1C;&#x897F;&#x6700;&#x597D;&#x4E86;<br>&#x611F;&#x89C9;&#x8FD9;&#x6761;&#x8DEF;&#x8FD8;&#x662F;&#x5F88;&#x957F;&#x5F88;&#x957F;&#x7684;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x7EC4;&#x4EE5;&#x540E;&#x80FD;&#x4E0D;&#x80FD;&#x641E;&#x51FA;&#x4E00;&#x756A;&#x4E8B;&#x4E1A;&#xFF0C;&#x8BF4;&#x5B9E;&#x8BDD;&#x56FD;&#x5185;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#xFF0C;&#x4E5F;&#x5C31;&#x8FD9;&#x4E24;&#x4E2A;&#x5382;&#x53EF;&#x80FD;&#x641E;&#x51FA;&#x4E2A;&#x6837;&#x5B50;&#x4E86;<br>&#x5982;&#x679C;TX&#x771F;&#x7684;&#x80FD;&#x91CD;&#x89C6;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x5E0C;&#x671B;&#x7684;&#x3002;<br>&#x867D;&#x7136;&#x5E02;&#x573A;&#x5F88;&#x771F;&#x5B9E;&#xFF0C;&#x4F46;&#x662F;&#x505A;&#x81EA;&#x5DF1;&#x7684;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x5E94;&#x8BE5;&#x8FD8;&#x662F;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x8005;&#x4EEC;&#x6700;&#x540E;&#x7684;&#x4E00;&#x4EFD;&#x6267;&#x7740;&#x5427;&#x3002;</p>
<p><strong>&#x5E0C;&#x671B;&#x80FD;&#x7ED9;&#x8FD9;&#x4E9B;&#x6267;&#x7740;&#x7684;&#x50BB;&#x74DC;&#x4EEC;&#x4E00;&#x6761;&#x51FA;&#x8DEF;</strong></p>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Diary/">#Diary</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/IEG/">#IEG</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/2020/09/22/Nothing-2020-9-22/">Nothing-2020-9-22</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2020/05/26/Learning-DB-lwt/">Learning-DB-lwt</a>
            
        </span>
    </div>
    
</article>




<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'http://yoursite.com/2020/07/19/Internship-Diary-July-19/';
        this.page.identifier = '2020/07/19/Internship-Diary-July-19/';
        
        this.language = 'zh';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'peter' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript" target="_blank" rel="noopener">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 Jerome&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/peter-819" target="_blank" rel="noopener">
                    
                    GitHub
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>