<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>Nothing-2021-2-9 - Jerome&#39;s Blog</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="WHU sutdent, Computer Graphic, Game Engine">





    <meta name="description" content="&amp;#x53C8;&amp;#x9694;&amp;#x4E86;&amp;#x5C0F;&amp;#x534A;&amp;#x5E74;&amp;#x4E86;&amp;#xFF0C;&amp;#x518D;&amp;#x6765;&amp;#x66F4;&amp;#x70B9;&amp;#x5E9F;&amp;#x8BDD;">
<meta property="og:type" content="article">
<meta property="og:title" content="Nothing-2021-2-9">
<meta property="og:url" content="http://yoursite.com/2021/02/09/Nothing-2021-2-9/index.html">
<meta property="og:site_name" content="Jerome&#39;s Blog">
<meta property="og:description" content="&amp;#x53C8;&amp;#x9694;&amp;#x4E86;&amp;#x5C0F;&amp;#x534A;&amp;#x5E74;&amp;#x4E86;&amp;#xFF0C;&amp;#x518D;&amp;#x6765;&amp;#x66F4;&amp;#x70B9;&amp;#x5E9F;&amp;#x8BDD;">
<meta property="og:locale" content="zh_CN">
<meta property="article:published_time" content="2021-02-08T16:56:09.000Z">
<meta property="article:modified_time" content="2021-02-08T18:41:58.737Z">
<meta property="article:author" content="Jerome">
<meta property="article:tag" content="Dairy">
<meta name="twitter:card" content="summary">





<link rel="icon" href="/images/logo.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


<meta name="generator" content="Hexo 4.2.0"><link rel="alternate" href="/atom.xml" title="Jerome's Blog" type="application/atom+xml">
</head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    Jerome&#39;s Blog
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/archives">档案</a>
            
            <a class="navbar-item "
               href="/categories/Internship">实习</a>
            
            <a class="navbar-item "
               href="/categories/Development">开发</a>
            
            <a class="navbar-item "
               href="/categories/Learning">学习</a>
            
            <a class="navbar-item "
               href="/categories/JEngine">JEngine</a>
            
            <a class="navbar-item "
               href="/about">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/peter-819" target="_blank" rel="noopener">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            Nothing-2021-2-9
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2021-02-08T16:56:09.000Z" itemprop="datePublished">2月 9 2021</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/Nothing/">Nothing</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            17 分钟 读完 (约 2562 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>&#x53C8;&#x9694;&#x4E86;&#x5C0F;&#x534A;&#x5E74;&#x4E86;&#xFF0C;&#x518D;&#x6765;&#x66F4;&#x70B9;&#x5E9F;&#x8BDD;</p>
<a id="more"></a>

<p>&#x5C0F;&#x534A;&#x5E74;&#x53D1;&#x751F;&#x4E86;&#x4E5F;&#x4E0D;&#x5C11;&#x4E8B;&#x60C5;&#xFF0C;&#x672C;&#x6765;&#x8FD8;&#x4EE5;&#x4E3A;&#x56DE;&#x5230;&#x5B66;&#x6821;&#x4F1A;&#x5F88;&#x65E0;&#x804A;&#x7684;</p>
<p>&#x6211;&#x8131;&#x5355;&#x4E86;</p>
<p>&#x6211;&#x8BB0;&#x5F97;&#x662F;&#x53BB;&#x5E74;&#xFF0C;&#x554A;&#x4E0D;&#xFF0C;&#x524D;&#x5E74;&#x4E0A;&#x6982;&#x7387;&#x8BBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5076;&#x7136;&#x770B;&#x5230;&#x7684;&#x5979;</p>
<p>&#x5F53;&#x65F6;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x89C9;&#x5F97;&#x5F88;&#x597D;&#x770B;&#xFF0C;&#x662F;&#x6211;&#x559C;&#x6B22;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x7136;&#x540E;&#x5176;&#x5B9E;&#x4ECE;&#x90A3;&#x5929;&#x4E0A;&#x5B8C;&#x8BFE;&#x5F00;&#x59CB;&#x5C31;&#x5728;&#x60F3;&#x529E;&#x6CD5;&#x627E;&#x627E;&#x8FD9;&#x4E2A;&#x4EBA;&#x662F;&#x8C01;</p>
<p>&#x5F53;&#x65F6;&#x597D;&#x50CF;&#x53EA;&#x77E5;&#x9053;&#x5979;&#x8BA4;&#x8BC6;&#x8BFE;&#x4EE3;&#x8868;&#xFF0C;&#x597D;&#x50CF;&#x8FD8;&#x8BA4;&#x8BC6;xlx&#xFF0C;&#x4E5F;&#x8BB0;&#x4E0D;&#x6E05;&#x5F53;&#x65F6;&#x5177;&#x4F53;&#x662F;&#x600E;&#x4E48;&#x627E;&#x5230;&#x7684;QQ&#x7684;&#x4E86;</p>
<p>&#x5927;&#x6982;&#x662F;&#x53BB;&#x8BFE;&#x7A0B;&#x7FA4;&#x7FFB;&#x4E86;&#x4E00;&#x4E0B;&#x4E0D;&#x8BA4;&#x8BC6;&#x7684;&#x5973;&#x751F;&#xFF0C;&#x7136;&#x540E;&#x6392;&#x9664;&#x4E86;&#x4E00;&#x756A;&#x5269;&#x4E86;&#x51E0;&#x4E2A;&#x4EBA;&#xFF0C;&#x7136;&#x540E;&#x5979;&#x7684;&#x7A7A;&#x95F4;&#x6CA1;&#x6709;&#x9501;</p>
<p>&#x8BD5;&#x7740;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E0B;&#x597D;&#x53CB;&#xFF0C;&#x8FD8;&#x5728;&#x63E3;&#x6469;&#x8BF4;&#x53E5;&#x5565;&#x597D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EBA;&#x5C45;&#x7136;&#x6CA1;&#x6709;&#x597D;&#x53CB;&#x7533;&#x8BF7;&#x9A8C;&#x8BC1;&#xFF0C;&#x76F4;&#x63A5;&#x5C31;&#x901A;&#x8FC7;&#x4E86;</p>
<p>&#x76F4;&#x63A5;&#x5C2C;&#x4F4F;&#xFF0C;&#x8FD9;&#x8BF4;&#x53E5;&#x4EC0;&#x4E48;&#x624D;&#x80FD;&#x4E0D;&#x50CF;&#x4E2A;hentai&#x5462;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x6CA1;&#x6709;&#x52C7;&#x6C14;&#x8BF4;&#x8BDD;&#x4E86;</p>
<br>

<p>&#x8C01;&#x77E5;&#x9053;&#x4E0B;&#x4E00;&#x6B21;&#x5C31;&#x662F;&#x4E00;&#x5E74;&#x4E4B;&#x540E;&#x662F;&#x4E00;&#x8D77;&#x4E0A;.net&#xFF0C;&#x7B2C;&#x4E00;&#x8282;&#x8BFE;&#x73ED;&#x4E0A;&#x4E00;&#x5171;&#x4E5F;&#x6CA1;&#x6709;&#x51E0;&#x4E2A;&#x4EBA;&#xFF0C;&#x8D70;&#x8FDB;&#x6559;&#x5BA4;&#x770B;&#x5230;&#x540E;&#x9762;&#x5750;&#x7684;&#x662F;&#x5979;&#x8DDF;&#x53E6;&#x4E00;&#x4E2A;&#x5973;&#x751F;</p>
<p>&#x5C31;&#x968F;&#x4FBF;&#x5750;&#x5728;&#x4E86;&#x53F3;&#x624B;&#x8FB9;&#xFF0C;&#x5F53;&#x65F6;&#x8FD8;&#x6CA1;&#x6709;&#x505C;&#x6389;&#x7EBF;&#x4E0A;&#x5B9E;&#x4E60;&#xFF0C;&#x4E0A;&#x8BFE;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x5728;&#x60F3;&#x7740;&#x9879;&#x76EE;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x751A;&#x81F3;&#x4E0A;&#x8BFE;&#x4E2D;&#x95F4;&#x8DD1;&#x51FA;&#x53BB;&#x8FDE;&#x6668;&#x4F1A;</p>
<p>jxy&#x4E5F;&#x61D2;&#x5F97;&#x8BB2;&#x8BFE;&#x4E86;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x53BB;&#x770B;ppt&#xFF0C;&#x770B;&#x5B8C;&#x628A;&#x540E;&#x9762;&#x7684;&#x7EC3;&#x4E60;&#x9898;&#x505A;&#x4E86;&#x5F53;&#x4F5C;&#x4F5C;&#x4E1A;</p>
<p>&#x7EC3;&#x4E60;&#x9898;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0A;&#x5B66;&#x671F;jxy&#x7684;C#&#x8BFE;&#x5C31;&#x662F;&#x7559;&#x7684;&#x8FD9;&#x4E2A;&#x4F5C;&#x4E1A;&#xFF0C;lwt&#x597D;&#x50CF;&#x53D1;&#x8FC7;&#x8FD9;&#x4E9B;&#x9898;&#x76EE;</p>
<p>&#x5F53;&#x65F6;&#x8FD8;&#x633A;&#x8BA4;&#x771F;&#x5730;&#x5199;&#x4E86;&#x4EE3;&#x7801;&#xFF0C;&#x60F3;&#x770B;&#x770B;&#x81EA;&#x5DF1;&#x5728;&#x5B9E;&#x4E60;&#x7684;&#x65F6;&#x5019;&#x4EE3;&#x7801;&#x957F;&#x8FDB;&#x4E86;&#x6CA1;&#x6709;</p>
<p>&#x7136;&#x540E;&#x5199;&#x5B8C;jxy&#x8BA9;&#x4E0A;&#x53BB;&#x628A;&#x4EE3;&#x7801;&#x653E;&#x5728;&#x6295;&#x5F71;&#x4E0A;&#x8BB2;&#x4E00;&#x4E0B;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x8BB2;&#xFF0C;&#x9898;&#x76EE;&#x53C8;&#x4E0D;&#x96BE;&#xFF0C;&#x6211;&#x7684;&#x4EE3;&#x7801;&#x53C8;&#x4E0D;&#x7F8E;&#x89C2;</p>
<p>&#x968F;&#x4FBF;&#x8BB2;&#x4E86;&#x8BB2;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#xFF0C;&#x56DE;&#x6765;&#x7EE7;&#x7EED;&#x8FDC;&#x7A0B;&#x516C;&#x53F8;&#x7535;&#x8111;&#x770B;&#x4EE3;&#x7801;&#xFF0C;&#x51FA;&#x53BB;&#x8FDE;&#x6668;&#x4F1A;</p>
<p>&#x770B;&#x7740;&#x4EE3;&#x7801;jxy&#x6765;&#x627E;&#x6211;&#x804A;&#x5929;&#xFF0C;&#x6253;&#x542C;&#x6211;&#x5B9E;&#x4E60;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8BF4;&#x8FD9;&#x8BF4;&#x90A3;</p>
<br>

<p>&#x540E;&#x6765;lxg&#x4E0D;&#x77E5;&#x9053;&#x54EA;&#x5929;&#x7A81;&#x7136;&#x5728;&#x7FA4;&#x91CC;&#x8BF4;&#x5979;&#x5728;&#x8DDF;&#x548C;&#x6211;&#x4E00;&#x8D77;&#x4E0A;.net&#x8BFE;&#x7684;&#x4E24;&#x4E2A;&#x59B9;&#x5B50;&#x5403;kfc&#xFF0C;&#x53EF;&#x662F;&#x90A3;&#x4E2A;&#x8BFE;&#x4E00;&#x5171;&#x5C31;&#x4E24;&#x4E2A;&#x59B9;&#x5B50;</p>
<p>&#x968F;&#x53E3;&#x5F00;&#x73A9;&#x7B11;&#x8BF4;&#x8981;&#x4E0D;&#x8981;&#x7EC4;&#x961F;&#xFF0C;&#x6211;&#x8BF4;&#x5979;&#x4FE9;&#x8981;&#x662F;&#x4E0D;&#x5ACC;&#x5F03;&#x6211;&#x90A3;&#x6562;&#x60C5;&#x597D;&#x554A;</p>
<p>&#x4E09;&#x4E2A;&#x4EBA;&#x5C31;&#x7EC4;&#x961F;&#x4E86;&#xFF0C;&#x5979;&#x53D1;&#x4E86;&#x4EFD;&#x8F6F;&#x4EF6;&#x6784;&#x9020;&#x7684;uml&#x56FE;&#xFF0C;&#x60F3;&#x505A;&#x90A3;&#x4E2A;&#x5F53;&#x5927;&#x4F5C;&#x4E1A;</p>
<p>&#x6211;&#x5F53;&#x65F6;&#x81EA;&#x5DF1;&#x60F3;&#x597D;&#x597D;&#x505A;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x5199;&#x8FDB;&#x7B80;&#x5386;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x953B;&#x70BC;&#x4E00;&#x4E0B;&#x67B6;&#x6784;&#x7684;&#x80FD;&#x529B;</p>
<p>&#x7136;&#x540E;&#x5176;&#x5B9E;&#x8111;&#x8865;&#x4E86;&#x633A;&#x4E45;&#xFF0C;&#x8111;&#x8865;&#x4E86;&#x505A;&#x5B9E;&#x65F6;UI&#xFF0C;&#x8111;&#x8865;&#x4E86;&#x505A;&#x79BB;&#x7EBF;&#x6E32;&#x67D3;&#xFF0C;&#x8111;&#x8865;&#x4E86;&#x505A;&#x4E91;&#x6E32;&#x67D3;</p>
<p>&#x7136;&#x540E;&#x6211;&#x8BF4;&#x8981;&#x4E0D;&#x6309;&#x6211;&#x7684;&#x60F3;&#x6CD5;&#x505A;&#x5427;&#xFF0C;&#x5F53;&#x65F6;&#x5176;&#x5B9E;&#x6211;&#x8FD8;&#x6CA1;&#x6709;&#x786E;&#x5B9A;&#x5230;&#x5E95;&#x8981;&#x505A;&#x54EA;&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x662F;&#x5728;&#x8111;&#x4E2D;&#x75AF;&#x72C2;&#x904D;&#x5386;C#&#x53EF;&#x4EE5;&#x5199;&#x4EC0;&#x4E48;&#x6E32;&#x67D3;&#x76F8;&#x5173;&#x7684;&#x4E1C;&#x897F;</p>
<p>&#x4E00;&#x76F4;&#x5230;&#x540E;&#x9762;&#x51E0;&#x6B21;&#x4E0A;&#x8BFE;&#xFF0C;&#x505A;&#x5B9E;&#x65F6;ui jxy&#x8BF4;&#x4E0D;&#x597D;&#xFF0C;&#x540E;&#x6765;&#x6211;&#x8BF4;&#x505A;&#x4E91;&#x6E32;&#x67D3;&#x5427;&#xFF0C;&#x968F;&#x4FBF;&#x53E3;&#x7CCA;&#x4E86;&#x51E0;&#x53E5;jxy&#x89C9;&#x5F97;&#x884C;&#x4E86;</p>
<p>&#x7136;&#x540E;&#x597D;&#x51E0;&#x5929;&#x65F6;&#x95F4;&#x62FF;&#x7740;&#x7B14;&#x5728;&#x82CF;&#x83F2;&#x4E0A;&#x753B;&#x4E86;&#x5DE8;&#x7F8E;&#x597D;&#x7684;&#x4E00;&#x4E2A;&#x67B6;&#x6784;&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x73B0;&#x5B9E;&#x73B0;&#x6210;&#x672C;&#x5B9E;&#x5728;&#x592A;&#x9AD8;&#x4E86;</p>
<p>&#x6211;&#x81EA;&#x5DF1;&#x751A;&#x81F3;&#x90FD;&#x6709;60%&#x4E0D;&#x4F1A;&#xFF0C;&#x522B;&#x8BF4;&#x8BA9;&#x5979;&#x4EEC;&#x4ECE;&#x5934;&#x5B66;&#x4E86;</p>
<p>&#x540E;&#x6765;&#x81EA;&#x5DF1;&#x4E00;&#x70B9;&#x70B9;&#x6478;&#x7D22;&#x9609;&#x5272;&#xFF0C;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;&#x53D1;&#x73B0;&#x4E00;&#x65B9;&#x9762;&#x6211;&#x8FD8;&#x662F;&#x4E0D;&#x4F1A;&#x5206;&#x914D;&#x4EFB;&#x52A1;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x6211;&#x89C9;&#x5F97;&#x5979;&#x4EEC;&#x4E5F;&#x4E0D;&#x4F1A;&#x60F3;&#x4ECE;&#x5934;&#x518D;&#x5B66;&#x6E32;&#x67D3;</p>
<p>&#x5C31;&#x53EA;&#x80FD;&#x81EA;&#x5DF1;&#x6765;&#x4E86;hh&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x6CA1;copy&#x4EE3;&#x7801;&#x4ECE;&#x5934;&#x5199;&#xFF0C;&#x867D;&#x7136;&#x5168;&#x662F;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x548C;bug&#xFF0C;&#x4F46;&#x662F;&#x52C9;&#x5F3A;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x5C55;&#x793A;&#x4E86;&#x4E0B;</p>
<br>

<p>&#x8FD8;&#x8BB0;&#x5F97;&#x521A;&#x7EC4;&#x961F;&#x7684;&#x90A3;&#x8282;&#x8BFE;&#x4E0B;&#x8BFE;&#x4E4B;&#x540E;&#xFF0C;&#x5979;&#x8BF4;&#x8FD8;&#x8981;&#x53BB;&#x5353;&#x5C14;&#x8DF3;&#x821E;&#xFF0C;&#x6211;&#x5C31;&#x5148;&#x5403;&#x4E86;&#x996D;&#x56DE;&#x4E86;</p>
<p>&#x7761;&#x4E86;&#x4E00;&#x4E0B;&#x5348;&#x5230;&#x665A;&#x4E0A;&#x60F3;&#x7740;&#xFF0C;&#x8BA4;&#x8BC6;&#x90FD;&#x8BA4;&#x8BC6;&#x4E86;&#xFF0C;&#x8FD8;&#x662F;&#x627E;&#x4E2A;&#x673A;&#x4F1A;&#x804A;&#x4E0B;&#x53ED;</p>
<p>&#x53D1;qq&#x95EE;&#x8981;&#x4E0D;&#x8981;&#x4E00;&#x8D77;&#x53BB;&#x5403;&#x665A;&#x996D;&#xFF0C;&#x5403;&#x5B8C;&#x996D;&#x6211;&#x8981;&#x53BB;&#x4E0A;&#x516C;&#x9009;&#xFF0C;&#x7ED3;&#x679C;&#x6CA1;&#x60F3;&#x5230;&#x5979;&#x8BF4;&#x60F3;&#x8981;&#x548C;&#x6211;&#x4E00;&#x8D77;&#x53BB;&#x4E0A;&#x516C;&#x9009;&#x8BFE;</p>
<p>&#x90A3;&#x5929;&#x4E0B;&#x7740;&#x96E8;&#xFF0C;&#x6211;&#x4EEC;&#x6253;&#x7740;&#x4E00;&#x628A;&#x4F1E;&#xFF0C;&#x8D70;&#x5230;&#x4E86;&#x56FD;&#x9645;&#x6559;&#x80B2;&#x5B66;&#x9662;&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x8FF7;&#x8DEF;&#x4E86;&#x4E00;&#x4F1A;</p>
<p>&#x8BFE;&#x4E0A;&#x4E00;&#x8FB9;&#x770B;&#x7740;&#x5947;&#x602A;&#x7684;&#x7535;&#x5F71;&#xFF08;&#x7535;&#x5F71;&#x97F3;&#x4E50;&#x9274;&#x8D4F;&#x7684;&#x7535;&#x5F71;&#x53E3;&#x5473;&#x90FD;&#x6BD4;&#x8F83;&#x51B2;&#xFF09;&#xFF0C;&#x804A;&#x7740;&#x6709;&#x7684;&#x6CA1;&#x7684;</p>
<p>&#x770B;&#x5230;&#x5979;&#x6234;&#x7684;&#x6212;&#x6307;&#x597D;&#x5947;&#x8BF4;&#x633A;&#x597D;&#x770B;&#x7684;&#xFF0C;&#x5979;&#x8BF4;&#x8981;&#x94FE;&#x63A5;&#x5417;hh</p>
<p>&#x4E0B;&#x8BFE;&#x4E86;&#xFF0C;&#x6253;&#x7740;&#x4F1E;&#x4E00;&#x8D77;&#x8D70;&#x56DE;&#x4FE1;&#x90E8;&#xFF0C;&#x4E0B;&#x7740;&#x96E8;&#xFF0C;&#x5929;&#x5F88;&#x51B7;&#xFF0C;&#x8DEF;&#x4E0A;&#x5F88;&#x5B89;&#x9759;</p>
<p>&#xFF08;&#x8BF4;&#x8D77;&#x6765;&#x5F53;&#x65F6;&#x4E4B;&#x524D;&#x90FD;&#x662F;&#x5B66;&#x5F1F;&#x9A91;&#x8F66;&#x5E26;&#x6211;&#x53BB;&#x7684;&#xFF0C;&#x771F;&#x662F;&#x9E3D;&#x4E86;&#x5B66;&#x5F1F;&#x597D;&#x51E0;&#x6B21;&#x5462;&#xFF09;</p>
<br>

<p>&#x7B2C;&#x4E8C;&#x5929;&#x5979;&#x8BF4;&#x8981;&#x4E0D;&#x8981;&#x4E00;&#x8D77;&#x53BB;&#x4E0A;&#x7B97;&#x6CD5;&#x8BFE;&#xFF0C;&#x6211;&#x8111;&#x8865;&#x4E86;&#x4E00;&#x4E0B;&#x540E;&#x9762;&#x51E0;&#x4E2A;&#x57FA;&#x53CB;&#x770B;&#x5230;&#x4E4B;&#x540E;&#x7684;&#x6837;&#x5B50;</p>
<p>&#x7136;&#x540E;&#x663E;&#x7136;&#x662F;&#x7B54;&#x5E94;&#x4E86;&#xFF0C;&#x679C;&#x4E0D;&#x5176;&#x7136;&#xFF0C;&#x8FD9;&#x7FA4;b&#x5728;&#x7FA4;&#x91CC;&#x76F4;&#x63A5;&#x70B8;&#x88C2;</p>
<p>&#x4E2D;&#x5348;&#x53BB;&#x5403;&#x4E2A;&#x996D;&#x8FD8;&#x88AB;&#x4EBA;&#x5077;&#x62CD;&#x53D1;&#x7FA4;&#x91CC;&#xFF0C;&#x6211;&#x771F;&#x662F;&#x6709;&#x6392;&#x9762;&#x554A;</p>
<p>&#x7136;&#x540E;&#x5C31;&#x662F;&#x540E;&#x9762;&#x51E0;&#x5929;lxg&#x62C9;&#x7740;&#x53BB;&#x5403;&#x996D;&#xFF0C;&#x5C34;&#x5C2C;&#x5730;&#x5750;&#x5728;&#x5BF9;&#x9762;&#x4E0D;&#x77E5;&#x6240;&#x63AA;</p>
<p>&#x4E00;&#x8D77;&#x770B;&#x7535;&#x5F71;&#xFF0C;&#x4E00;&#x8D77;&#x559D;&#x5976;&#x8336;&#xFF0C;&#x8FD8;&#x9001;&#x4E86;&#x6211;&#x90A3;&#x4E2A;&#x6212;&#x6307;&#xFF08;&#x867D;&#x7136;&#x6234;&#x8D77;&#x6765;&#x4F1A;&#x6389;&#x8272;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#xFF09;&#xFF0C;&#x540E;&#x6765;&#x95EE;&#x6211;&#x8981;&#x4E0D;&#x8981;&#x4E00;&#x8D77;&#x53BB;&#x6B22;&#x4E50;&#x8C37;&#x73A9;</p>
<p>&#x55EF;&#xFF0C;&#x7535;&#x5F71;&#x5F88;&#x597D;&#x770B;&#xFF08;&#x5927;&#x6982;&#x5427;&#xFF0C;&#x6CE8;&#x610F;&#x529B;&#x5E94;&#x8BE5;&#x4E0D;&#x5728;&#x7535;&#x5F71;&#x4E0A;&#xFF09;&#xFF0C;&#x5976;&#x8336;&#x5F88;&#x597D;&#x559D;&#xFF08;&#x8FD8;&#x771F;&#x6709;&#x4EBA;&#x4E00;&#x5929;&#x4E00;&#x676F;&#xFF09;&#xFF0C;&#x6B22;&#x4E50;&#x8C37;&#x4E5F;&#x5F88;&#x597D;&#x73A9;&#xFF08;&#x6392;&#x961F;play&#xFF09;</p>
<p>&#x5750;&#x4E86;&#x8FC7;&#x5C71;&#x8F66;&#x4E0B;&#x6765;&#x5C31;&#x62C9;&#x7740;&#x6211;&#xFF08;&#x4F60;&#x8BF4;&#x662F;&#x6211;&#x62C9;&#x7684;&#x4F60;&#xFF09;</p>
<p>&#x4E00;&#x8D77;&#x5728;&#x4EBA;&#x5806;&#x91CC;&#x770B;&#x6E38;&#x884C;&#xFF0C;&#x611F;&#x89C9;&#x4F60;&#x770B;&#x4E0D;&#x5230;&#x5C31;&#x62C9;&#x4F60;&#x53BB;&#x524D;&#x9762;&#x770B;</p>
<p>&#x4E00;&#x8D77;&#x62CD;&#x4E86;&#x81EA;&#x62CD;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x5F53;&#x65F6;&#x5C31;&#x89C9;&#x5F97;&#x597D;&#x50CF;&#x5DF2;&#x7ECF;&#x5728;&#x4E00;&#x8D77;&#x5F88;&#x4E45;&#x7684;&#x4E24;&#x4E2A;&#x4EBA;&#x51FA;&#x53BB;&#x73A9;&#x4E00;&#x6837;</p>
<p>&#x672C;&#x6765;&#x60F3;&#x5728;&#x56DE;&#x6765;&#x7684;&#x65F6;&#x5019;&#x95EE;&#x4F60;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x8D77;&#x5417;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x5408;&#x7167;&#x53D1;&#x670B;&#x53CB;&#x5708;&#x5566;</p>
<p>&#x7ED3;&#x679C;&#x6CA1;&#x8BF4;&#x51FA;&#x6765;&#x524D;&#x534A;&#x53E5;&#xFF0C;xs</p>
<p>&#x8FD8;&#x662F;&#x5728;&#x4FE1;&#x64CD;&#x95EE;&#x6211;&#xFF0C;&#x8FD9;&#x6837;&#x7B97;&#x662F;&#x5728;&#x4E00;&#x8D77;&#x4E86;&#x5417;&#xFF1F;&#x5F53;&#x7136;&#x7B97;&#x554A;</p>
<br>

<p>&#x5176;&#x5B9E;&#x6211;&#x81EA;&#x5DF1;&#x672C;&#x8EAB;&#x771F;&#x7684;&#x5F88;&#x5185;&#x5411;&#xFF0C;&#x5F88;&#x4E0D;&#x64C5;&#x957F;&#x8DDF;&#x4EBA;&#x4EA4;&#x6D41;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x8BA9;&#x81EA;&#x5DF1;&#x89C9;&#x5F97;&#x5C34;&#x5C2C;</p>
<p>&#x5728;&#x548C;&#x522B;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x5C3D;&#x529B;&#x8868;&#x73B0;&#x51FA;&#x4E00;&#x79CD;&#x5BB9;&#x6613;&#x6C9F;&#x901A;&#x7684;&#x6837;&#x5B50;</p>
<p>&#x5176;&#x5B9E;&#x6211;&#x4E0D;&#x64C5;&#x957F;&#x804A;&#x6211;&#x4E0D;&#x719F;&#x6089;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x4E0D;&#x64C5;&#x957F;&#x63A5;&#x89E6;&#x4E0D;&#x719F;&#x6089;&#x7684;&#x4EBA;</p>
<p>&#x719F;&#x6089;&#x6211;&#x7684;&#x4EBA;&#x90FD;&#x4F1A;&#x89C9;&#x5F97;&#x6211;&#x8BDD;&#x5F88;&#x5C11;&#xFF0C;&#x867D;&#x7136;&#x813E;&#x6C14;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x65E0;&#x804A;</p>
<p>&#x8BF4;&#x8BDD;&#x4E0D;&#x60F3;&#x8BA9;&#x522B;&#x4EBA;&#x5C34;&#x5C2C;&#xFF0C;&#x4E5F;&#x4E0D;&#x60F3;&#x81EA;&#x5DF1;&#x5C34;&#x5C2C;&#xFF0C;&#x90A3;&#x5C31;&#x5C11;&#x8BF4;&#x53ED;</p>
<p>&#x60F3;&#x505A;&#x4EC0;&#x4E48;&#x4E8B;&#xFF0C;&#x60F3;&#x4E86;&#x60F3;&#x53EF;&#x80FD;&#x522B;&#x4EBA;&#x89C9;&#x5F97;&#x4E0D;&#x59A5;&#xFF0C;&#x90A3;&#x5C31;&#x4E0D;&#x505A;&#x53ED;</p>
<p>&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x7279;&#x957F;&#xFF0C;&#x51C6;&#x786E;&#x7684;&#x8BF4;&#x662F;&#x6CA1;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x5C55;&#x793A;&#x7684;&#x4E1C;&#x897F;</p>
<p>&#x6211;&#x4E5F;&#x6709;&#x559C;&#x6B22;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x53EA;&#x662F;&#x4E0D;&#x5BB9;&#x6613;&#x5C55;&#x793A;&#x7ED9;&#x522B;&#x4EBA;&#x770B;&#x7F62;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x5BB9;&#x6613;&#x8BA9;&#x522B;&#x4EBA;get&#x5230;&#x8FD9;&#x4E1C;&#x897F;&#x6709;&#x4EC0;&#x4E48;&#x4E50;&#x8DA3;</p>
<p>&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x7FA1;&#x6155;&#x90A3;&#x4E9B;&#x6709;&#x7279;&#x957F;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x5C55;&#x793A;&#x7ED9;&#x522B;&#x4EBA;&#x770B;&#x7684;&#x4EBA;</p>
<p>&#x89C9;&#x5F97;&#x4ED6;&#x4EEC;&#x597D;&#x5E05;&#xFF0C;&#x6211;&#x53EA;&#x4F1A;&#x62B1;&#x7740;&#x7535;&#x8111;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x5728;&#x5E72;&#x4EC0;&#x4E48;</p>
<p>&#x6211;&#x559C;&#x6B22;&#x8F6E;&#x6ED1;&#xFF0C;&#x559C;&#x6B22;&#x505A;&#x6210;&#x4E00;&#x4E2A;&#x82B1;&#x5239;&#x52A8;&#x4F5C;&#x65F6;&#x5019;&#x7684;&#x6210;&#x5C31;&#x611F;&#xFF0C;&#x867D;&#x7136;&#x4F1A;&#x6454;&#x5F88;&#x4E45;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x4F1A;&#x4E00;&#x4E24;&#x4E2A;&#x52A8;&#x4F5C;</p>
<p>&#x559C;&#x6B22;&#x526A;&#x89C6;&#x9891;&#xFF0C;&#x559C;&#x6B22;&#x770B;&#x522B;&#x4EBA;&#x62CD;&#x7684;&#x8FD0;&#x955C;&#x8F6C;&#x573A;&#xFF0C;&#x770B;&#x600E;&#x4E48;&#x7528;&#x955C;&#x5934;&#x8BED;&#x8A00;&#x8BB2;&#x4E0D;&#x540C;&#x4EBA;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x770B;&#x82B1;&#x91CC;&#x80E1;&#x54E8;&#x7684;&#x7279;&#x6548;&#x5236;&#x4F5C;&#xFF0C;</p>
<p>&#x867D;&#x7136;&#x83DC;&#x5F97;&#x82B1;&#x51E0;&#x5341;&#x4E2A;&#x5C0F;&#x65F6;&#x53EA;&#x80FD;&#x526A;&#x51FA;&#x6765;&#x4E00;&#x4E2A;&#x4E94;&#x5206;&#x949F;&#x5F88;&#x65E0;&#x804A;&#x7684;&#x89C6;&#x9891;</p>
<p>&#x559C;&#x6B22;&#x7F16;&#x7A0B;&#x5199;&#x6E32;&#x67D3;&#xFF0C;&#x559C;&#x6B22;&#x6572;&#x6210;&#x7684;&#x4E00;&#x884C;&#x884C;&#x4EE3;&#x7801;&#x5C31;&#x80FD;&#x53D8;&#x6210;&#x5C4F;&#x5E55;&#x4E0A;&#x4F1A;&#x52A8;&#x7684;&#x6B63;&#x65B9;&#x4F53;&#xFF0C;&#x867D;&#x7136;&#x5199;&#x4E0A;&#x5343;&#x884C;&#x4E5F;&#x53EA;&#x80FD;&#x753B;&#x51FA;&#x4E00;&#x4E2A;&#x4E09;&#x89D2;&#x5F62;</p>
<p>&#x559C;&#x6B22;&#x770B;&#x4EBA;&#x505A;3d&#x5EFA;&#x6A21;&#xFF0C;&#x770B;&#x52A0;&#x901F;&#x5FEB;&#x653E;&#x7684;&#x89C6;&#x9891;&#x91CC;&#x4ECE;&#x4E00;&#x4E2A;&#x6B63;&#x65B9;&#x4F53;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x6829;&#x6829;&#x5982;&#x751F;&#x7684;&#x4EBA;&#x7269;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x5F88;&#x590D;&#x6742;&#x7684;&#x5EFA;&#x7B51;&#x7FA4;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x8FDE;&#x4E00;&#x4E2A;&#x623F;&#x5B50;&#x90FD;&#x5EFA;&#x4E0D;&#x597D;</p>
<br>

<p>&#x5F88;&#x5947;&#x602A;&#xFF0C;&#x559C;&#x6B22;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x4F1A;</p>
<br>

<p>&#x4E5F;&#x7279;&#x522B;&#x60F3;&#x628A;&#x559C;&#x6B22;&#x7684;&#x4E1C;&#x897F;&#x53D8;&#x6210;&#x804C;&#x4E1A;&#xFF0C;&#x81EA;&#x5DF1;&#x53BB;&#x641C;&#x8D44;&#x6599;&#x5B66;&#x56FE;&#x5F62;&#x5B66;&#xFF0C;&#x6BCF;&#x5929;&#x60E6;&#x8BB0;&#x63D0;&#x524D;&#x51C6;&#x5907;&#x9762;&#x8BD5;&#x53BB;&#x5B9E;&#x4E60;&#x5F15;&#x64CE;&#x5F00;&#x53D1;&#xFF0C;&#x5B9E;&#x4E60;&#x7684;&#x65F6;&#x5019;&#x60E6;&#x8BB0;&#x600E;&#x4E48;&#x627E;&#x66F4;&#x597D;&#x7684;offer</p>
<p>&#x73B0;&#x5728;&#x53C8;&#x60F3;&#x8F6C;&#x6280;&#x672F;&#x7F8E;&#x672F;&#xFF0C;&#x53C8;&#x8981;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x5B66;&#xFF0C;&#x5B66;&#x5199;shader&#xFF0C;&#x5B66;&#x5199;postprocess&#xFF0C;&#x5B66;Maya&#xFF0C;&#x5B66;UE4</p>
<p>&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x8BF4;&#x8FD9;&#x4E9B;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x524D;&#x89C4;&#x5212;&#x81EA;&#x5DF1;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x9519;&#x5462;</p>
<p>&#x4F46;&#x662F;&#x5176;&#x5B9E;&#x8111;&#x5B50;&#x91CC;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x80FD;&#x88C5;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x8003;&#x8651;&#x660E;&#x5929;&#x4E0B;&#x6708;&#x660E;&#x5E74;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x4F1A;&#x5FFD;&#x89C6;&#x6389;&#x4E00;&#x4E9B;&#x73B0;&#x5728;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;</p>
<p>&#x751A;&#x81F3;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5F88;&#x51B7;&#x6F20;&#xFF0C;&#x53EA;&#x8981;&#x65E0;&#x5173;&#x81EA;&#x5DF1;&#x672A;&#x6765;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x597D;&#x50CF;&#x90FD;&#x53EF;&#x4EE5;&#x65E0;&#x89C6;</p>
<p>&#x4E5F;&#x4E0D;&#x600E;&#x4E48;&#x4F1A;&#x4EAB;&#x53D7;&#x73B0;&#x5728;&#xFF0C;&#x8FD8;&#x8BB0;&#x5F97;&#x5F53;&#x65F6;&#x5728;&#x6DF1;&#x5733;&#x53BB;&#x9152;&#x5427;&#x5750;&#x7740;&#xFF0C;&#x8DDF;&#x82D7;&#x6539;&#x9E2D;&#x795E;&#x5728;&#x90A3;&#x4E2A;&#x5929;&#x53F0;&#x7684;&#x9152;&#x5427;</p>
<p>&#x70B9;&#x4E86;&#x4E00;&#x676F;Dry Martini&#xFF0C;&#x559D;&#x7740;&#x9152;&#x5439;&#x7740;&#x98CE;&#xFF0C;&#x4EFF;&#x4F5B;&#x53EA;&#x6709;&#x90A3;&#x4E00;&#x4E2A;&#x77AC;&#x95F4;&#x89C9;&#x5F97;&#x73B0;&#x5728;&#x771F;&#x597D;</p>
<p>&#x5B8C;&#x5168;&#x4E0D;&#x7528;&#x60F3;&#x4E00;&#x4F1A;&#x8BE5;&#x5E72;&#x4EC0;&#x4E48;&#xFF0C;&#x660E;&#x5929;&#x8981;&#x51E0;&#x70B9;&#x4E0A;&#x73ED;&#xFF0C;&#x4E0B;&#x4E2A;&#x6708;&#x662F;&#x4E0D;&#x662F;&#x8981;&#x56DE;&#x5B66;&#x6821;&#xFF0C;&#x660E;&#x5E74;&#x80FD;&#x4E0D;&#x80FD;&#x62FF;&#x5230;&#x60F3;&#x8981;&#x7684;offer</p>
<br>

<p>&#x5982;&#x679C;&#x73B0;&#x5728;&#x6709;&#x5927;&#x4E8C;&#x5927;&#x4E09;&#x7684;&#x540C;&#x5B66;&#x95EE;&#x6211;&#x8981;&#x4E0D;&#x8981;&#x63D0;&#x524D;&#x53BB;&#x5B9E;&#x4E60;&#xFF0C;&#x6211;&#x4E00;&#x5B9A;&#x4F1A;&#x544A;&#x8BC9;&#x4ED6;&#xFF0C;&#x4E0D;&#x8981;&#xFF0C;&#x5728;&#x5B66;&#x6821;&#x5C31;&#x73CD;&#x60DC;&#x73B0;&#x5728;&#x7684;&#x65F6;&#x5149;&#x5427;</p>
<br>

<p>&#x53EA;&#x60F3;&#x80FD;&#x575A;&#x6301;&#x5B66;&#x4E0B;&#x53BB;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x51E0;&#x4E2A;&#x7231;&#x597D;&#xFF0C;&#x80FD;&#x51ED;&#x7740;&#x7231;&#x597D;&#x627E;&#x5230;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x5DF2;&#x7ECF;&#x4E0D;&#x60F3;&#x4EF0;&#x671B;&#x5927;&#x4F6C;&#x4EEC;&#x4E86;&#xFF0C;&#x8FC7;&#x597D;&#x73B0;&#x5728;&#x5C31;&#x597D;&#x5427;</p>
<p>&#x5E0C;&#x671B;&#x4E0B;&#x5B66;&#x671F;&#x7684;&#x9762;&#x8BD5;&#x987A;&#x5229;&#x4E00;&#x70B9;&#xFF0C;&#x5176;&#x5B9E;&#x4E5F;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x60F3;&#x53BB;&#x7684;&#x516C;&#x53F8;&#x4E86;</p>
<p>&#x8DDF;&#x5979;&#x53BB;&#x4E0A;&#x6D77;&#x5427;&#xFF0C;&#x5E0C;&#x671B;&#x7C73;&#x54C8;&#x6E38;TA&#x4E0A;&#x5CB8;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6295;&#x70B9;&#x80B2;&#x78A7;Epic&#x4E0A;&#x6D77;&#xFF0C;&#x770B;&#x770B;tx&#x4E0A;&#x6D77;&#x6709;&#x6CA1;&#x6709;&#x4E5F;&#x884C;&#xFF0C;&#x54EA;&#x4E2A;&#x4E0A;&#x5CB8;&#x90FD;&#x53EF;&#x4EE5;</p>
<p>&#x5E0C;&#x671B;&#x5979;&#x4E5F;&#x80FD;&#x987A;&#x5229;&#x4FDD;&#x7814;&#x60F3;&#x8981;&#x7684;&#x4E13;&#x4E1A;&#x5427;</p>
<br>

<p>&#x8C01;&#x7684;&#x751F;&#x6D3B;&#x90FD;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x5FEB;&#x4E50;&#x5C31;&#x597D;&#x3002;</p>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Dairy/">#Dairy</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/2021/02/18/Nothing-2021-2-18/">Nothing-2021-2-18</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2020/12/22/dev-OpenGL-1/">图形学兔兔作业</a>
            
        </span>
    </div>
    
</article>




<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'http://yoursite.com/2021/02/09/Nothing-2021-2-9/';
        this.page.identifier = '2021/02/09/Nothing-2021-2-9/';
        
        this.language = 'zh';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'peter' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript" target="_blank" rel="noopener">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2021 Jerome&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/peter-819" target="_blank" rel="noopener">
                    
                    GitHub
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>